# FabricationPart Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart Class
Members See Also
---
Represents a fabrication component in the Autodesk Revit MEP product.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationPart : Element
```

Visual Basic
---
```text
Public Class FabricationPart _
	Inherits Element
```

Visual C++
---
```text
public ref class FabricationPart : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FabricationPart
# See Also
FabricationPart Members
Autodesk.Revit.DB Namespace